var library = [
	{
		name: "Hello World!",
		code: "🔝\n"+
				"	🏃\n"+
				"		✏️(💬👋🌍💬)❤️\n"+
				"	🔚\n"+
				"🔚🏁"
	},
	{
		name: "If Statement Example",
		code: "🔝\n"+
				"	🏃\n"+
				"		😄 👉 2❤️\n"+
				"\n"+
				"		🆗 😄 ▶️ 5\n"+
				"		🏃\n"+
				"			✏️(💬👍💬)❤️\n"+
				"		🔚❤️\n"+
				"\n"+
				"		🆗 😄 ◀️ 5\n"+
				"		🏃\n"+
				"			✏️(💬👎💬)❤️\n"+
				"		🔚❤️\n"+
				"	🔚\n"+
				"🔚🏁"
	},
	{
		name: "While Loop Example",
		code: "🔝\n"+
				"	🏃\n"+
				"		😊 👉 0❤️\n"+
				"\n"+
				"		🔁 😊 ◀️ 10 \n"+
				"		🏃\n"+
				"			😊👉😊➕1❤️\n"+
				"			✏️(😊)❤️\n"+
				"		🔚❤️\n"+
				"	🔚\n"+
				"🔚🏁"
	},
	{
		name: "Prime Tester",
		code: "🔝\n" +
				"	🏃\n" +
				"		😊 👉 37❤️\n" +
				"		😂 👉 👍❤️\n" +
				"		✏️(😊 ➕ 💬 is a prime:💬)❤️\n" +
				"\n" +
				"		🆗 😊 ◀️ 2\n" +
				"		🏃\n" +
				"			😂 👉 👎❤️\n" +
				"		🔚❤️\n" +
				"		🆗 (😊 💔 2 🏇 0 🍺 😊 💔 3 🏇 0) 🍻 (😊 ▶️ 3)\n" +
				"		🏃\n" +
				"			😂 👉 👎❤️\n" +
				"		🔚❤️\n" +
				"		😍 👉 5❤️\n" +
				"		🔁 😍✖️😍 ◀️ 😊\n" +
				"		🏃" +
				"			😍 👉 😍 ➕ 2❤️\n" +
				"			🆗 😊 💔 😍 🏇 0\n" +
				"			🏃\n" +
				"				😂 👉 👎❤️\n" +
				"			🔚❤️\n" +
				"		🔚❤️\n" +
				"		✏️(😂)❤️\n" +
				"	🔚\n" +
				"🔚🏁"
	},
	{
		name: "Fibonaci Sequence",
		code: "🔝\n" +
				"	🏃\n" +
				"		😊 👉 0❤️\n" +
				"		😂 👉 1❤️\n" +
				"		✏️(😂)❤️\n" +
				"		🔁 😊➕😂 ◀️ 50 🏃\n" +
				"			✏️(😊➕😂)❤️\n" +
				"\n" +
				"			😚 👉 😊❤️\n" +
				"			😊 👉 😂❤️\n" +
				"			😂 👉 😚➕😂❤️\n" +
				"		🔚❤️\n" +
				"	🔚\n" +
				"🔚🏁"
	}
]